DionLegierse/ProjectPaulusma/STM32/WeatherStation/Src/main.c
}

/*
 INPUT: the input of the function requires a pointer to a buffer, with the temprature data
 stored in the first two bytes, and the length of the buffer
 The minimal amount of space required is 4 bytes.
 OUTPUT: returns a zero (ABORTED) if the buffer was not large enough and a one (SUCCES) if conversion was succcesfull
 FUNCTION: this functions takes the first two bytes in the buffer and
 converts them to a string and stores this string in the first three bytes of the buffer.
 The buffer always requires a storage space in the back for a point within the string.
 */
uint8_t convert_data_to_temp_string(uint8_t * buffer, uint8_t bufferLength) {
	if (bufferLength < 5)
		return ABORTED ;
	else {
		uint16_t data = buffer[0] << MSB_OFFSET | buffer[1];
		int tempratureTimesTen = (int) roundf(
				((((data * 175.72) / 65536) - 46.85) * 100));
		itoa(tempratureTimesTen, (char *) buffer, 10);
		buffer[bufferLength - 1] = buffer[2];
		buffer[2] = '.';
		buffer[3] = buffer[bufferLength - 1];
		buffer[4] = '\0';
		return SUCCES ;
	}
}

/*
 INPUT: the input of the function requires a pointer to a buffer, with the humidity data
 stored in the first two bytes, and the length of the buffer
 The minimal amount of space required in the buffer is 2 bytes.
 OUTPUT: returns a zero (ABORTED) if the buffer was not large enough and a one (SUCCES) if conversion was succcesfull
 FUNCTION: this functions takes the first two bytes in the buffer and
 converts them to a string and stores this string in the first two bytes of the buffer.
 */
uint8_t convert_data_to_humid_string(uint8_t * buffer, uint8_t bufferLength) {
	if (bufferLength < 3)
		return ABORTED ;
	else {
		uint16_t data = buffer[0] << MSB_OFFSET | buffer[1];
		int humidTimesTen = (int) roundf(((((data * 125) / 65536) - 6) * 100));
		itoa(humidTimesTen, (char *) buffer, 10);
		buffer[2] = '\0';
		return SUCCES ;
	}
}

/* USER CODE END 4 */

//Global variables
float globalPressure = 0;
float globalTemperature = 0;
uint8_t globalHumidity = 0;

uint8_t pressureDoneFlag = 0;
uint8_t temperatureDoneFlag = 0;
uint8_t humidityDoneFlag = 0;

/* StartTaskTemperature function */
void StartTaskTemperature(void const * argument)
{

  /* USER CODE BEGIN 5 */
	uint8_t commandLoadTemp = 0xE3;

	uint8_t buffer[ MAX_BUFFER_SIZE];

	/* Infinite loop */
	for (;;) {
		get_data_from_is7021(buffer, &commandLoadTemp, MAX_BUFFER_SIZE);

		convert_data_to_temp_string(buffer, MAX_BUFFER_SIZE);

		globalTemperature = (float)atof(buffer);
		temperatureDoneFlag = READY;

		uint8_t str[5];
		strcpy(str,buffer);
		sprintf(buffer, "%s degree Celsius\n", str);

		xSemaphoreTake(UART2BusMutexHandle, UART_MUTEX_TIMEOUT);
		HAL_UART_Transmit(&huart2,buffer, strlen(buffer), 100);
		xSemaphoreGive(UART2BusMutexHandle);
		osDelay(STANDARD_OS_DELAY);
	}
  /* USER CODE END 5 */ 
}

/* startTaskHumidity function */
void startTaskHumidity(void const * argument)
{
	uint8_t commandLoadHumidity = 0xE5;

	uint8_t buffer[MAX_BUFFER_SIZE];

	/* Infinite loop */
	for (;;) {
		get_data_from_is7021(buffer, &commandLoadHumidity, MAX_BUFFER_SIZE);

		convert_data_to_humid_string(buffer, MAX_BUFFER_SIZE);

		globalHumidity = (uint8_t)atoi(buffer);
		humidityDoneFlag = READY;

		uint8_t str[3];
		strcpy(str,buffer);
		sprintf(buffer, "%s percent humid\n", str);
		xSemaphoreTake(UART2BusMutexHandle, UART_MUTEX_TIMEOUT);
		HAL_UART_Transmit(&huart2, buffer, strlen(buffer), STANDARD_TIMEOUT);
		xSemaphoreGive(UART2BusMutexHandle);
		osDelay(STANDARD_OS_DELAY);
	}
}

/* startTaskPressure function */
void startTaskPressure(void const * argument)
{
  /* USER CODE BEGIN startTaskPressure */
	/* Infinite loop */
	uint8_t buffer[MAX_BUFFER_SIZE];
	memset(buffer, '\n', MAX_BUFFER_SIZE);

	for (;;) {
		globalPressure = getPressure();
		pressureDoneFlag = READY;

		sprintf(buffer, "%d millibar\n", (uint32_t)globalPressure);

		xSemaphoreTake(UART2BusMutexHandle, UART_MUTEX_TIMEOUT);
		HAL_UART_Transmit(&huart2, buffer, strlen(buffer), STANDARD_TIMEOUT);
		xSemaphoreGive(UART2BusMutexHandle);
		osDelay(STANDARD_OS_DELAY);
	}
  /* USER CODE END startTaskPressure */
}

/* startTaskWifi function */
void startTaskWifi(void const * argument)
{
  /* USER CODE BEGIN startTaskWifi */
  /* Infinite loop */
  for(;;)
  {
	  if(humidityDoneFlag && pressureDoneFlag && temperatureDoneFlag){
		  humidityDoneFlag = pressureDoneFlag = temperatureDoneFlag = NOT_READY;
	  }
	  osDelay(STANDARD_OS_DELAY);
  }
  /* USER CODE END startTaskWifi */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
